## Instructions

Instructions: Please do HW1 in Jupyter Notebook using Python. Submit an HTML file and ipynb file following the link in Modules, and then HW1, and finally clicking the submit button to access files on your computer. When working on the HWs, please do not display unnecessary data unless it is asked. Each problem is with 20 points.
##### Due on 9/3/2021, Friday at 11:59 pm in Canvas

# Problem 1. 
The longest known word in the English language is given by pneumonoultramicroscopicsilicovolcanoconiosisis. You can google to find out what it means.  Read more about dictionaries here https://docs.python.org/3/tutorial/datastructures.html#dictionaries  and sets in python here https://www.geeksforgeeks.org/sets-in-python/.

a) Using python in Jupyter notebook, make a list of all the letters in this word. 

b) Change the list in (a)  to a set to find out a unique set of alphabets used in this word.  

c) Considering a set U of 26 English alphabets as a Universal set, find the complement of the set in (b) using python.

d) Create a dictionary with these unique letters in the set (b) as keys and the number of times these letters appear in the word as values. Your dictionary should look like $D=\{a: 2, c:6,\cdots\cdot\cdots\}$ as a appears 2 times, and c appears 6 times in the original

In [55]:
# Answer Problem 1 here.Add cells asneeded.

In [94]:
list_long_word=list('pneumonoultramicroscopicsilicovolcanoconiosisis')

In [ ]:
# This makes a sorted list of the letter of the word "pneumonoultramicroscopicsilicovolcanoconiosisis".

In [95]:
print(sorted(list_long_word))

['a', 'a', 'c', 'c', 'c', 'c', 'c', 'c', 'e', 'i', 'i', 'i', 'i', 'i', 'i', 'i', 'l', 'l', 'l', 'm', 'm', 'n', 'n', 'n', 'n', 'o', 'o', 'o', 'o', 'o', 'o', 'o', 'o', 'o', 'p', 'p', 'r', 'r', 's', 's', 's', 's', 's', 't', 'u', 'u', 'v']

In [ ]:
# This turns that list into a set.

In [96]:
set_long_word=set(list_long_word)

In [97]:
print(sorted(set_long_word))

['a', 'c', 'e', 'i', 'l', 'm', 'n', 'o', 'p', 'r', 's', 't', 'u', 'v']

In [ ]:
# Here I'm creating a set of all of the letters of the alphabet.

In [98]:
letters=set("abcdefghijklmnopqrstuwxyz")

In [99]:
print(sorted(letters))

['a', 'b', 'c', 'd', 'e', 'f', 'g', 'h', 'i', 'j', 'k', 'l', 'm', 'n', 'o', 'p', 'q', 'r', 's', 't', 'u', 'w', 'x', 'y', 'z']

In [ ]:
# This is a set of all of the letters that aren't in "pneumonoultramicroscopicsilicovolcanoconiosisis".

In [100]:
complement=letters-set_long_word

In [101]:
print(sorted(complement))

['b', 'd', 'f', 'g', 'h', 'j', 'k', 'q', 'w', 'x', 'y', 'z']

In [ ]:
# This is a dictionary of the letters in "pneumonoultramicroscopicsilicovolcanoconiosisis".

In [102]:
D={x:sorted(list_long_word).count(x) for x in sorted(list_long_word)}

In [103]:
print(D)

{'a': 2, 'c': 6, 'e': 1, 'i': 7, 'l': 3, 'm': 2, 'n': 4, 'o': 9, 'p': 2, 'r': 2, 's': 5, 't': 1, 'u': 2, 'v': 1}

# Problem 2
Another word, supercalifragilisticexpialidocious, has 34 letters. Find a set B of unique letters in this word. Let‚Äôs denote a set you found in problem 1(b) by A. Do the following using python in Jupyter notebook.  

a) Find the union and intersection of A and B.

b) Find  and $A-B, B-A$ and $A\Delta B$.

c) Verify and find out if the statement $A-B = A\cap B^c$ or $A-B = A^c\cap B$ is true.

d) Verify both De Morgan‚Äôs law for set theory for A and B.

In [66]:
# Problem 2 solution goes here.

In [104]:
# I'm making the set of letters in "pneumonoultramicroscopicsilicovolcanoconiosisis" easier to use than "set_long_word".
A=set_long_word

In [108]:
# Here I'm making a set of the letters in "supercalifragilisticexpialidocious".
B=set('supercalifragilisticexpialidocious')

In [112]:
# The letters in either word.
print(sorted(A.union(B)))

['a', 'c', 'd', 'e', 'f', 'g', 'i', 'l', 'm', 'n', 'o', 'p', 'r', 's', 't', 'u', 'v', 'x']

In [113]:
# The letters shared between the words.
print(sorted(A.intersection(B)))

['a', 'c', 'e', 'i', 'l', 'o', 'p', 'r', 's', 't', 'u']

In [116]:
print(sorted(A-B))

['m', 'n', 'v']

In [117]:
print(sorted(B-A))

['d', 'f', 'g', 'x']

In [173]:
# Here is one way to do ùê¥Œîùêµ.
print(sorted((A-B).union(B-A)))

['d', 'f', 'g', 'm', 'n', 'v', 'x']

In [120]:
# Here is another way to do ùê¥Œîùêµ.
print(sorted((A.union(B))-(A.intersection(B))))

['d', 'f', 'g', 'm', 'n', 'v', 'x']

In [141]:
A-B==A.intersection(letters-B)

False

In [142]:
A-B==(letters-A).intersection(B)

False

In [145]:
# Verify De Morgan‚Äôs law.
letters-(A.union(B))==(letters-A).intersection(letters-B)

True

In [146]:
# Verify De Morgan‚Äôs law.
letters-(A.intersection(B))==(letters-A).union(letters-B)

True

### Problem 3
Upload the .csv file titanic.csv that came with this HW in the notebook by following instructions here https://www.datacamp.com/community/tutorials/pandas-read-csv and name it as titanic. Make sure to import panda as pd and numpy as np.  Read the details about the titanic data here https://data.world/nrippner/titanic-disaster-dataset Answer the following questions. Learn more about the Boolean mask https://stackoverflow.com/questions/38802675/create-bool-mask-from-filter-results-in-pandas about filtering data.

a) What happens If you type isna(titanic.cabin).any() and run it? Explain how this is related to either the disjunction or the conjunction in logic lecture we did.

b) How many passengers who paid the minimum fare survived? Hint- Statement p: Passenger survived. Statement q: Passenger paid the minimum fare.

c) What was the name of the female who was traveling in the first class from Cherbourg to Cooperstown, NY, and was 18 or younger? (full credit will be given to a solution that combines multiple statements using and/or and is a one-line code.)

d) Did anybody who didn‚Äôt pay any fare, had no cabin and didn‚Äôt have a destination survive?

In [154]:
#import packages
import pandas as pd # This is the package we used already. 
import numpy as np 
# Numpy is another python package that delas with numerical python.
#Learn more about it here https://numpy.org/. No need to download as
# it is inlcuded in the anaconda package.

In [167]:
# This gave me trouble as I didn'y realise I had my name in my own computer as "march" rather than "marc".
titanic=pd.read_csv('C:/Users/march/Home Work/titanic')

In [169]:
print(titanic)

      pclass  survived                                             name  \
0        1.0       1.0                    Allen, Miss. Elisabeth Walton
1        1.0       1.0                   Allison, Master. Hudson Trevor
2        1.0       0.0                     Allison, Miss. Helen Loraine
3        1.0       0.0             Allison, Mr. Hudson Joshua Creighton
4        1.0       0.0  Allison, Mrs. Hudson J C (Bessie Waldo Daniels)
...      ...       ...                                              ...
1305     3.0       0.0                            Zabour, Miss. Thamine
1306     3.0       0.0                        Zakarian, Mr. Mapriededer
1307     3.0       0.0                              Zakarian, Mr. Ortin
1308     3.0       0.0                               Zimmerman, Mr. Leo
1309     NaN       NaN                                              NaN

         sex      age  sibsp  parch  ticket      fare    cabin embarked boat  \
0     female  29.0000    0.0    0.0   24160  211.3375       B5        S    2
1       male   0.9167    1.0    2.0  113781  151.5500  C22 C26        S   11
2     female   2.0000    1.0    2.0  113781  151.5500  C22 C26        S  NaN
3       male  30.0000    1.0    2.0  113781  151.5500  C22 C26        S  NaN
4     female  25.0000    1.0    2.0  113781  151.5500  C22 C26        S  NaN
...      ...      ...    ...    ...     ...       ...      ...      ...  ...
1305  female      NaN    1.0    0.0    2665   14.4542      NaN        C  NaN
1306    male  26.5000    0.0    0.0    2656    7.2250      NaN        C  NaN
1307    male  27.0000    0.0    0.0    2670    7.2250      NaN        C  NaN
1308    male  29.0000    0.0    0.0  315082    7.8750      NaN        S  NaN
1309     NaN      NaN    NaN    NaN     NaN       NaN      NaN      NaN  NaN

       body                        home.dest
0       NaN                     St Louis, MO
1       NaN  Montreal, PQ / Chesterville, ON
2       NaN  Montreal, PQ / Chesterville, ON
3     135.0  Montreal, PQ / Chesterville, ON
4       NaN  Montreal, PQ / Chesterville, ON
...     ...                              ...
1305    NaN                              NaN
1306  304.0                              NaN
1307    NaN                              NaN
1308    NaN                              NaN
1309    NaN                              NaN

[1310 rows x 14 columns]

In [181]:
# I'm not exactly sure what is going on with this.
isna(titanic.cabin).any()

NameError: name 'isna' is not defined

In [188]:
# This is saying that there is atleast one NA value in cabin.
titanic.cabin.isna().any()

True

In [234]:
# I'm not sure what the minimum fare was, but googling it I found it to be $15.Though I'm not sure what units our data is in.
survived_fare=(titanic['survived']==1) & (titanic['fare']>15)

In [235]:
# 330 passengers who paid a fare of at least $15 survived.
titanic[survived_fare]

,pclass,survived,name,sex,age,sibsp,parch,ticket,fare,cabin,embarked,boat,body,home.dest
0,1.0,1.0,"Allen, Miss. Elisabeth Walton",female,29.0000,0.0,0.0,24160,211.3375,B5,S,2,NaN,"St Louis, MO"
1,1.0,1.0,"Allison, Master. Hudson Trevor",male,0.9167,1.0,2.0,113781,151.5500,C22 C26,S,11,NaN,"Montreal, PQ / Chesterville, ON"
5,1.0,1.0,"Anderson, Mr. Harry",male,48.0000,0.0,0.0,19952,26.5500,E12,S,3,NaN,"New York, NY"
6,1.0,1.0,"Andrews, Miss. Kornelia Theodosia",female,63.0000,1.0,0.0,13502,77.9583,D7,S,10,NaN,"Hudson, NY"
8,1.0,1.0,"Appleton, Mrs. Edward Dale (Charlotte Lamson)",female,53.0000,2.0,0.0,11769,51.4792,C101,S,D,NaN,"Bayside, Queens, NY"
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
1189,3.0,1.0,"Sandstrom, Miss. Marguerite Rut",female,4.0000,1.0,1.0,PP 9549,16.7000,G6,S,13,NaN,NaN
1247,3.0,1.0,"Thorneycroft, Mrs. Percival (Florence Kate White)",female,NaN,1.0,0.0,376564,16.1000,NaN,S,10,NaN,NaN
1256,3.0,1.0,"Touma, Master. Georges Youssef",male,7.0000,1.0,1.0,2650,15.2458,NaN,C,C,NaN,NaN
1257,3.0,1.0,"Touma, Miss. Maria Youssef",female,9.0000,1.0,1.0,2650,15.2458,NaN,C,C,NaN,NaN
1258,3.0,1.0,"Touma, Mrs. Darwis (Hanne Youssef Razi)",female,29.0000,0.0,2.0,2650,15.2458,NaN,C,C,NaN,NaN

In [282]:
mystery=(titanic['sex']=='female')&(titanic['pclass']==1)&((titanic['age']==18)|(titanic['age']<18))

In [283]:
# There were only 8 females 18 or under that were in the first class,
# and none of them were traveling from Cherbourg to Cooperstown, NY.
# However, Emily Borie Ryerson's (250) destination was Cooperstown, NY.
titanic[mystery]

,pclass,survived,name,sex,age,sibsp,parch,ticket,fare,cabin,embarked,boat,body,home.dest
2,1.0,0.0,"Allison, Miss. Helen Loraine",female,2.0,1.0,2.0,113781,151.5500,C22 C26,S,NaN,NaN,"Montreal, PQ / Chesterville, ON"
11,1.0,1.0,"Astor, Mrs. John Jacob (Madeleine Talmadge Force)",female,18.0,1.0,0.0,PC 17757,227.5250,C62 C64,C,4,NaN,"New York, NY"
55,1.0,1.0,"Carter, Miss. Lucile Polk",female,14.0,1.0,2.0,113760,120.0000,B96 B98,S,4,NaN,"Bryn Mawr, PA"
92,1.0,1.0,"Dick, Mrs. Albert Adrian (Vera Gillespie)",female,17.0,1.0,0.0,17474,57.0000,B20,S,3,NaN,"Calgary, AB"
159,1.0,1.0,"Hippach, Miss. Jean Gertrude",female,16.0,0.0,1.0,111361,57.9792,B18,C,4,NaN,"Chicago, IL"
187,1.0,1.0,"Lines, Miss. Mary Conover",female,16.0,0.0,1.0,PC 17592,39.4000,D28,S,9,NaN,"Paris, France"
193,1.0,1.0,"Madill, Miss. Georgette Alexandra",female,15.0,0.0,1.0,24160,211.3375,B5,S,2,NaN,"St Louis, MO"
195,1.0,1.0,"Maioni, Miss. Roberta",female,16.0,0.0,0.0,110152,86.5000,B79,S,8,NaN,NaN
198,1.0,1.0,"Marvin, Mrs. Daniel Warner (Mary Graham Carmic...",female,18.0,1.0,0.0,113773,53.1000,D30,S,10,NaN,"New York, NY"
229,1.0,1.0,"Penasco y Castellana, Mrs. Victor de Satode (M...",female,17.0,1.0,0.0,PC 17758,108.9000,C65,C,8,NaN,"Madrid, Spain"
250,1.0,1.0,"Ryerson, Miss. Emily Borie",female,18.0,2.0,2.0,PC 17608,262.3750,B57 B59 B63 B66,C,4,NaN,"Haverford, PA / Cooperstown, NY"
270,1.0,1.0,"Smith, Mrs. Lucien Philip (Mary Eloise Hughes)",female,18.0,1.0,0.0,13695,60.0000,C31,S,6,NaN,"Huntington, WV"
289,1.0,1.0,"Taussig, Miss. Ruth",female,18.0,0.0,2.0,110413,79.6500,E68,S,8,NaN,"New York, NY"

### Problem 4. 
Continuing with the titanic data set, answer the following questions.

a) Filter the titanic data with the condition that $|\text{fare} - \text{mean(fare)}|< 0.5$ (the sign | is absolute value sign here) and get a subset of the titanic data.

b) Excluding the NaN values for the variable ticket, find out how many tickets were used by more than a passenger?

c) Create a new column with a column name ‚Äúluck‚Äù  in the titanic data set with the following rules. Let‚Äôs call a passenger ‚Äúunlucky‚Äù if the passenger was in the first-class, paid more than the average fare, and did not survive.  On the contrary, a passenger is ‚Äúlucky‚Äù if the passenger was not in the first class, paid less or equal to the average fare, and survived. Let‚Äôs call everybody else ‚Äúaverageluck‚Äù.  Show the head of the data with a visible luck column.

d) Find the number of lucky, unlucky, and passengers with average luck using a groupby function https://pandas.pydata.org/pandas-docs/stable/reference/api/pandas.DataFrame.groupby.html

In [379]:
titanic['fare'].describe()

count    1308.000000
mean       33.295479
std        51.758668
min         0.000000
25%         7.895800
50%        14.454200
75%        31.275000
max       512.329200
Name: fare, dtype: float64

In [383]:
# I can't figure out what is wrong. I don't know why fare has 0 data points.
mean_fare=(titanic.abs('fare'-mean('fare'))<0.5)

TypeError: can't convert type 'str' to numerator/denominator

In [430]:
mean_fare2=(titanic.abs('fare'-33.3)<0.5)

TypeError: unsupported operand type(s) for -: 'str' and 'float'

In [428]:
# WIP
titanic[mean_fare]

,pclass,survived,name,sex,age,sibsp,parch,ticket,fare,cabin,embarked,boat,body,home.dest,luck
7,1.0,0.0,"Andrews, Mr. Thomas Jr",male,39.0,0.0,0.0,112050,0.0,A36,S,NaN,NaN,"Belfast, NI",unlucky
70,1.0,0.0,"Chisholm, Mr. Roderick Robert Crispin",male,NaN,0.0,0.0,112051,0.0,NaN,S,NaN,NaN,"Liverpool, England / Belfast",unlucky
125,1.0,0.0,"Fry, Mr. Richard",male,NaN,0.0,0.0,112058,0.0,B102,S,NaN,NaN,NaN,unlucky
150,1.0,0.0,"Harrison, Mr. William",male,40.0,0.0,0.0,112059,0.0,B94,S,NaN,110.0,NaN,unlucky
170,1.0,1.0,"Ismay, Mr. Joseph Bruce",male,49.0,0.0,0.0,112058,0.0,B52 B54 B56,S,C,NaN,Liverpool,unlucky
223,1.0,0.0,"Parr, Mr. William Henry Marsh",male,NaN,0.0,0.0,112052,0.0,NaN,S,NaN,NaN,Belfast,unlucky
234,1.0,0.0,"Reuchlin, Jonkheer. John George",male,38.0,0.0,0.0,19972,0.0,NaN,S,NaN,NaN,"Rotterdam, Netherlands",unlucky
363,2.0,0.0,"Campbell, Mr. William",male,NaN,0.0,0.0,239853,0.0,NaN,S,NaN,NaN,Belfast,lucky
384,2.0,0.0,"Cunningham, Mr. Alfred Fleming",male,NaN,0.0,0.0,239853,0.0,NaN,S,NaN,NaN,Belfast,lucky
410,2.0,0.0,"Frost, Mr. Anthony Wood ""Archie""",male,NaN,0.0,0.0,239854,0.0,NaN,S,NaN,NaN,Belfast,lucky
473,2.0,0.0,"Knight, Mr. Robert J",male,NaN,0.0,0.0,239855,0.0,NaN,S,NaN,NaN,Belfast,lucky
528,2.0,0.0,"Parkes, Mr. Francis ""Frank""",male,NaN,0.0,0.0,239853,0.0,NaN,S,NaN,NaN,Belfast,lucky
581,2.0,0.0,"Watson, Mr. Ennis Hastings",male,NaN,0.0,0.0,239856,0.0,NaN,S,NaN,NaN,Belfast,lucky
896,3.0,0.0,"Johnson, Mr. Alfred",male,49.0,0.0,0.0,LINE,0.0,NaN,S,NaN,NaN,NaN,lucky
898,3.0,0.0,"Johnson, Mr. William Cahoone Jr",male,19.0,0.0,0.0,LINE,0.0,NaN,S,NaN,NaN,NaN,lucky
963,3.0,0.0,"Leonard, Mr. Lionel",male,36.0,0.0,0.0,LINE,0.0,NaN,S,NaN,NaN,NaN,lucky
1254,3.0,1.0,"Tornquist, Mr. William Henry",male,25.0,0.0,0.0,LINE,0.0,NaN,S,15,NaN,NaN,lucky

In [431]:
titanic[mean_fare2]

NameError: name 'mean_fare2' is not defined

In [356]:
# Dropping NaN values
titanict=titanic.dropna(subset=['ticket'])

In [376]:
# Ignoring the times tickets were used only once, 216 tickets were used by multiple people.
titanict['ticket'].value_counts().loc[lambda x:x>1]

CA. 2343    11
CA 2144      8
1601         8
PC 17608     7
347077       7
            ..
PC 17603     2
2665         2
7534         2
113789       2
2660         2
Name: ticket, Length: 216, dtype: int64

In [433]:
# Conditions for luck column.
def conditions(s):
    if (titanic['pclass'] == 1) & (titanic['fare'] > 33.3) & (titanic['survived'] == 0):
        return 'unlucky'
    if (titanic['pclass'] > 1) & (titanic['fare'] <= 33.3) & (titanic['survived'] == 1):
        return 'lucky'
    else:
        return 'averageluck'

In [436]:
# WIP
titanic['luck']=titanic.apply(conditions, axis=1)

ValueError: The truth value of a Series is ambiguous. Use a.empty, a.bool(), a.item(), a.any() or a.all().

In [426]:
# It looks like it worked?
titanic['luck']

0       unlucky
1       unlucky
2       unlucky
3       unlucky
4       unlucky
         ...
1305      lucky
1306      lucky
1307      lucky
1308      lucky
1309      lucky
Name: luck, Length: 1310, dtype: object

In [445]:
# I can't seem to make groupby work.
titanic.groupby('luck')

In [438]:
# no averageluck. The above didn't work.
titanic['luck'].value_counts()

lucky      987
unlucky    323
Name: luck, dtype: int64

### Problem 5
Write two data frames you see in the picture below in Jupyter notebook. You will have to manually type these and make two data frames DF1 and DF2.

a) Create a new data frame using the merge function with left join on ID. Explain which set operation this join corresponds to. You will see that there are some NaN values in the new data frame. Explain why? Read more about joins and concatenation here. 

b) Do the same as in (a) with right join. 

c) Do the same as in (a) with the inner join. Why are there no NaNs here?

d) Do the same as in (a) with an outer join.

In [446]:
data1 = {'ID':['s01','s05','s06', 's08'],
    'Name':['Julie', 'Carl', 'Luke', 'David'],
    'City': ['Des Moines', 'Iowa City', 'Chicago', 'Minneapolis'],
    'Age':[25, 34, 29, 45]}
df1 = pd.DataFrame(data1)
df1

    ID   Name         City  Age
0  s01  Julie   Des Moines   25
1  s05   Carl    Iowa City   34
2  s06   Luke      Chicago   29
3  s08  David  Minneapolis   45

In [447]:
data2 = {'ID':['s01','s08','s03', 's04'],
    'Name':['Julie', 'David', 'Bradley', 'Nina'],
    'City': ['Des Moines', 'Minneapolis', 'Tempe', 'Pittsburg'],
    'GPA':[3.25, 3.3, 3.4, 4]}
df2 = pd.DataFrame(data2)
df2

    ID     Name         City   GPA
0  s01    Julie   Des Moines  3.25
1  s08    David  Minneapolis  3.30
2  s03  Bradley        Tempe  3.40
3  s04     Nina    Pittsburg  4.00

In [451]:
# Merge function with left join on ID
df1.merge(df2, how='left', on='ID')
# This corresponds to df1 union (df1 intersect df2).
# The NaN values are because the people from df1 don't have y_names/cities, or a gpa.

    ID Name_x       City_x  Age Name_y       City_y   GPA
0  s01  Julie   Des Moines   25  Julie   Des Moines  3.25
1  s05   Carl    Iowa City   34    NaN          NaN   NaN
2  s06   Luke      Chicago   29    NaN          NaN   NaN
3  s08  David  Minneapolis   45  David  Minneapolis  3.30

In [452]:
# Merge function with right join on ID
df1.merge(df2, how='right', on='ID')
# This corresponds to df2 union (df1 intersect df2).
# The NaN values are because the people from df2 don't have x_names/cities, or age.

    ID Name_x       City_x   Age   Name_y       City_y   GPA
0  s01  Julie   Des Moines  25.0    Julie   Des Moines  3.25
1  s08  David  Minneapolis  45.0    David  Minneapolis  3.30
2  s03    NaN          NaN   NaN  Bradley        Tempe  3.40
3  s04    NaN          NaN   NaN     Nina    Pittsburg  4.00

In [453]:
# Merge function with inner join on ID
df1.merge(df2, how='inner', on='ID')
# This corresponds to intersection.
# There are no NaN values because we're only looking at what both dataframes share.

    ID Name_x       City_x  Age Name_y       City_y   GPA
0  s01  Julie   Des Moines   25  Julie   Des Moines  3.25
1  s08  David  Minneapolis   45  David  Minneapolis  3.30

In [454]:
# Merge function with outer join on ID
df1.merge(df2, how='outer', on='ID')
# This corresponds to union.
# The NaN values are because the people from df1 don't have y_names/cities, or a gpa, and df2 don't have x_names/cities, or age.

    ID Name_x       City_x   Age   Name_y       City_y   GPA
0  s01  Julie   Des Moines  25.0    Julie   Des Moines  3.25
1  s05   Carl    Iowa City  34.0      NaN          NaN   NaN
2  s06   Luke      Chicago  29.0      NaN          NaN   NaN
3  s08  David  Minneapolis  45.0    David  Minneapolis  3.30
4  s03    NaN          NaN   NaN  Bradley        Tempe  3.40
5  s04    NaN          NaN   NaN     Nina    Pittsburg  4.00

In [456]:
# I wanted to see how I would do on this with being new to python.
# Obviously I struggled and I need to use your office hours for help next time.